<a href="https://colab.research.google.com/github/prakashsukhwal/R-based-classes/blob/main/4_Basic_R_Data_Types_Data_frame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 4. Dataframe

## Use the Link below to create more R notebooks
### Note: do not forget to save your work in your google drive

[Use R on Google Colab!](https://colab.research.google.com/notebook#create=true&language=r)

In [ ]:
# uncomment run the code below only if you do not have 'pacman' installed
install.packages('pacman', repos = "http://cran.us.r-project.org")

In [ ]:
# using this we load the libraries (it installs the ones we do not have in our system)
pacman::p_load(tidyverse, FRACTION, lubridate, IRdisplay)

## Create

In [ ]:
##### Create

In [1]:
set.seed(100)
student_id = 101:105

age = sample(15:20, replace = TRUE, size = 5)

gender = sample(c("M","F"), 5, replace=TRUE, prob = c(0.6,0.4))

In [2]:
student_id = 101:105

age = sample(15:20, replace = TRUE, size = 5)

gender = sample(c("M","F"), 5, replace=TRUE, prob = c(0.6,0.4))
class_data = data.frame(student_id, gender, age)

In [3]:
class_data = data.frame(student_id, gender, age)

In [4]:
str(class_data)

'data.frame':	5 obs. of  3 variables:
 $ student_id: int  101 102 103 104 105
 $ gender    : chr  "F" "M" "F" "M" ...
 $ age       : int  20 18 20 16 17

In [5]:
class_data = data.frame(student_id, gender, age, stringsAsFactors = FALSE)

In [6]:
str(class_data)

'data.frame':	5 obs. of  3 variables:
 $ student_id: int  101 102 103 104 105
 $ gender    : chr  "F" "M" "F" "M" ...
 $ age       : int  20 18 20 16 17

## Type & Properties

In [ ]:
##### Type & Properties

In [7]:
class(class_data)
is.data.frame(class_data)

[1] "data.frame"

[1] TRUE

In [8]:
dim(class_data)

[1] 5 3

In [9]:
length(class_data)
ncol(class_data)
nrow(class_data)

[1] 3

[1] 3

[1] 5

In [ ]:
names(class_data)
colnames(class_data)

In [ ]:
rownames(class_data)

In [ ]:
attributes(class_data)

## Data Access: Using Index

In [ ]:
#### Data Access: Using Index

In [ ]:
class_data[1,]

In [ ]:
class_data[,1]

In [ ]:
class_data[,1, drop=FALSE] 
# drop = F to return a data frame

In [ ]:
class_data[1:2, 2:3] # Access specific data

## Using Names

In [ ]:
#### Using Names

In [ ]:
class_data$age

In [ ]:
class_data['age']

In [ ]:
class(class_data['age'])
typeof(class_data['age'])

In [ ]:
class_data[, c('student_id', 'age')]

In [ ]:
class_data[c('1', '3'), c('student_id', 'age')]

In [ ]:
str(class_data)

## Modify
1. Change a value
2. Add row or column
3. Merge 2 data frames 
4. Split data frame 
5. Delete

In [ ]:
##### Modify 
## 1. Change a value
## 2. Add row or column
## 3. Merge 2 data frames <br/> 4. Split data frame 5. Delete</p>

In [10]:
class_data[c(1,3),"age"] = 16
class_data

  student_id gender age
1 101        F      16
2 102        M      18
3 103        F      16
4 104        M      16
5 105        M      17

In [11]:
# Add a row
new_student = list(106, 'F', 18)
class_data = rbind(class_data, new_student)
class_data

  student_id gender age
1 101        F      16
2 102        M      18
3 103        F      16
4 104        M      16
5 105        M      17
6 106        F      18

### using a condition to modify
- 10 % discount to all younger than 16 yrs else flat 5%

In [ ]:
##### Using a condition to modify
## 10 % discount to all younger than 16 yrs else flat 5%

In [12]:
class_data$discount = ifelse(class_data$age < 16, 0.10, 0.05)
class_data

  student_id gender age discount
1 101        F      16  0.05
2 102        M      18  0.05
3 103        F      16  0.05
4 104        M      16  0.05
5 105        M      17  0.05
6 106        F      18  0.05

In [13]:
class_data$discount = NULL

In [14]:
# Add a column; call it 'height'
height = sample(150:180, replace = TRUE, size = 6)

In [15]:
class_data$height = height # can also use cbind()
class_data

  student_id gender age height
1 101        F      16  168
2 102        M      18  157
3 103        F      16  167
4 104        M      16  174
5 105        M      17  151
6 106        F      18  168

## Merge

In [ ]:
#### Merge

In [16]:
class_additional_info = data.frame(student_id = 101:106, 
                        nationality = sample(c("Asian",
                         "European", "Japanese"), 
                          size = 6, 
                          replace=TRUE),
                          stringsAsFactors = F)
class_additional_info

  student_id nationality
1 101        European
2 102        Asian
3 103        Japanese
4 104        Japanese
5 105        Asian
6 106        Japanese

In [17]:
# merge addtional info. with class_data
class_modified = merge(class_data, 
                       class_additional_info, 
                       by="student_id")

In [18]:
class_modified

  student_id gender age height nationality
1 101        F      16  168    European
2 102        M      18  157    Asian
3 103        F      16  167    Japanese
4 104        M      16  174    Japanese
5 105        M      17  151    Asian
6 106        F      18  168    Japanese

## Condition based creation

In [21]:
############################################################################
#age < 16 in group A, 16<= age < 18 B, rest C
############################################################################
class_modified$level[class_modified$age < 16] = 'A'
class_modified$level[class_modified$age >= 16 & class_modified$age < 18] = 'B'
class_modified$level[class_modified$age >= 18] = 'C'


############################################################################
#if id is even 'E' else 'O'
############################################################################

class_modified$oddeven = ifelse(class_modified$student_id %%2 !=0, 'O', 'E')
class_modified

  student_id gender age height nationality level oddeven
1 101        F      16  168    European    B     O
2 102        M      18  157    Asian       C     E
3 103        F      16  167    Japanese    B     O
4 104        M      16  174    Japanese    B     E
5 105        M      17  151    Asian       B     O
6 106        F      18  168    Japanese    C     E

## Split

In [ ]:
#### Split

In [ ]:
# split based on a column
(class_split = split(class_modified, class_modified$gender))

In [ ]:
#### Delete

## Delete

In [ ]:
# row
class_modified[-1,]

In [ ]:
# column
class_data$height = NULL
names(class_data)